#### IMPORTING LIBRARIES

In [71]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

In [72]:
test = pd.read_csv('../data/test.csv')
train = pd.read_csv('../data/train.csv')

/tmp/ipykernel_10585/466759996.py:2: DtypeWarning: Columns (26) have mixed types. Specify dtype option on import or set low_memory=False.
  train = pd.read_csv('../data/train.csv')

This warning implies corrupt data in some of the columns which do not match the dtype of the specified column.We will handle this first by cleaning the data.

#### CLEANING THE DATA

In [73]:
train.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good

In [74]:
train.dtypes

ID                           object
Customer_ID                  object
Month                        object
Name                         object
Age                          object
SSN                          object
Occupation                   object
Annual_Income                object
Monthly_Inhand_Salary       float64
Num_Bank_Accounts             int64
Num_Credit_Card               int64
Interest_Rate                 int64
Num_of_Loan                  object
Type_of_Loan                 object
Delay_from_due_date           int64
Num_of_Delayed_Payment       object
Changed_Credit_Limit         object
Num_Credit_Inquiries        float64
Credit_Mix                   object
Outstanding_Debt             object
Credit_Utilization_Ratio    float64
Credit_History_Age           object
Payment_of_Min_Amount        object
Total_EMI_per_month         float64
Amount_invested_monthly      object
Payment_Behaviour            object
Monthly_Balance              object
Credit_Score                 object
dtype: object

In [75]:
drop_columns=['ID',"Customer_ID","Name","SSN"]

The columns "ID," "Customer_ID," "Name," and "SSN" likely contain sensitive personal information. So we drop these columns to avoid building a model which involves sensitive personal information.

In [76]:
#Dropping the columns
train=train.drop(drop_columns,axis=1)
test=test.drop(drop_columns,axis=1)

In [77]:
#segregating the columns into numerical and categorical
categorical_columns = [cols for cols in train.columns if train[cols].dtype == object and cols != 'Credit_Score' ]
numerical_columns = [cols for cols in train.columns if train[cols].dtype != object]

In [78]:
categorical_columns

['Month',
 'Age',
 'Occupation',
 'Annual_Income',
 'Num_of_Loan',
 'Type_of_Loan',
 'Num_of_Delayed_Payment',
 'Changed_Credit_Limit',
 'Credit_Mix',
 'Outstanding_Debt',
 'Credit_History_Age',
 'Payment_of_Min_Amount',
 'Amount_invested_monthly',
 'Payment_Behaviour',
 'Monthly_Balance']

In [79]:
numerical_columns

['Monthly_Inhand_Salary',
 'Num_Bank_Accounts',
 'Num_Credit_Card',
 'Interest_Rate',
 'Delay_from_due_date',
 'Num_Credit_Inquiries',
 'Credit_Utilization_Ratio',
 'Total_EMI_per_month']

In [80]:
train[categorical_columns].head()

,Month,Age,Occupation,Annual_Income,Num_of_Loan,Type_of_Loan,Num_of_Delayed_Payment,Changed_Credit_Limit,Credit_Mix,Outstanding_Debt,Credit_History_Age,Payment_of_Min_Amount,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance
0,January,23,Scientist,19114.12,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",7,11.27,_,809.98,22 Years and 1 Months,No,80.41529543900253,High_spent_Small_value_payments,312.49408867943663
1,February,23,Scientist,19114.12,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",NaN,11.27,Good,809.98,NaN,No,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184
2,March,-500,Scientist,19114.12,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",7,_,Good,809.98,22 Years and 3 Months,No,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912
3,April,23,Scientist,19114.12,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",4,6.27,Good,809.98,22 Years and 4 Months,No,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786
4,May,23,Scientist,19114.12,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",NaN,11.27,Good,809.98,22 Years and 5 Months,No,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177

In [81]:
#Annual_Income and Num_of_Loan which should be numerical columns became object because of corrupt data, so we shall replace these particular values

train['Annual_Income']=train["Annual_Income"].apply(lambda x:x.replace("_","") if '_' in x else x)
test['Annual_Income']=test["Annual_Income"].apply(lambda x:x.replace("_","") if '_' in x else x)
train["Num_of_Loan"]=train["Num_of_Loan"].apply(lambda x:x.replace("_","")if "_" in x else x)
test["Num_of_Loan"]=test["Num_of_Loan"].apply(lambda x:x.replace("_","")if "_" in x else x)

In [82]:
train['Annual_Income']=train["Annual_Income"].astype(float)
test['Annual_Income']=test["Annual_Income"].astype(float)

In [83]:
categorical_columns.remove('Annual_Income')
numerical_columns.append('Annual_Income')

In [84]:
train["Num_of_Loan"]=train["Num_of_Loan"].astype(int)
test["Num_of_Loan"]=test["Num_of_Loan"].astype(int)

In [85]:
categorical_columns.remove('Num_of_Loan')
numerical_columns.append('Num_of_Loan')

In [86]:
train[categorical_columns].head()

,Month,Age,Occupation,Type_of_Loan,Num_of_Delayed_Payment,Changed_Credit_Limit,Credit_Mix,Outstanding_Debt,Credit_History_Age,Payment_of_Min_Amount,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance
0,January,23,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",7,11.27,_,809.98,22 Years and 1 Months,No,80.41529543900253,High_spent_Small_value_payments,312.49408867943663
1,February,23,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",NaN,11.27,Good,809.98,NaN,No,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184
2,March,-500,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",7,_,Good,809.98,22 Years and 3 Months,No,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912
3,April,23,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",4,6.27,Good,809.98,22 Years and 4 Months,No,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786
4,May,23,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",NaN,11.27,Good,809.98,22 Years and 5 Months,No,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177

In [87]:
#The next column we will try to modify is age as clearly age is a numerical column
train['Age'].unique()

array(['23', '-500', '28_', ..., '4808_', '2263', '1342'], dtype=object)

In [88]:
train['Age']=train["Age"].apply(lambda x:x.replace("_","") if '_' in x else x)
test['Age']=test["Age"].apply(lambda x:x.replace("_","") if '_' in x else x)

In [89]:
train['Age'].unique()

array(['23', '-500', '28', ..., '4808', '2263', '1342'], dtype=object)

In [90]:
train["Age"]=train["Age"].astype(int)
test["Age"]=test["Age"].astype(int)

In [91]:
#Dropping the negative values
mask = train['Age'] < 0
train = train.loc[~mask]
mask = test['Age'] < 0
test = test.loc[~mask]

In [92]:
train['Age'].unique()

array([  23,   28,   34, ..., 4808, 2263, 1342])

In [93]:
train.shape

(99114, 24)

In [94]:
#dropping the values which have age > 120
mask = train['Age'] >120
train = train.loc[~mask]

In [95]:
train.shape

(97230, 24)

In [96]:
train['Age'].unique()

array([ 23,  28,  34,  54,  55,  21,  31,  33,  30,  24,  44,  45,  40,
        41,  32,  35,  36,  39,  37,  20,  46,  26,  42,  19,  48,  38,
        43,  22,  16,  18,  15,  27,  25,  14,  17,  47,  53,  56,  29,
        49,  51,  50,  52, 112, 118,  99, 100, 102, 111,  95, 109, 115])

The values now have a more suitable range and thus can be added to the numerical columns.

In [97]:
categorical_columns.remove('Age')
numerical_columns.append('Age')

In [98]:
train[categorical_columns].head()

,Month,Occupation,Type_of_Loan,Num_of_Delayed_Payment,Changed_Credit_Limit,Credit_Mix,Outstanding_Debt,Credit_History_Age,Payment_of_Min_Amount,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance
0,January,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",7,11.27,_,809.98,22 Years and 1 Months,No,80.41529543900253,High_spent_Small_value_payments,312.49408867943663
1,February,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",NaN,11.27,Good,809.98,NaN,No,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184
3,April,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",4,6.27,Good,809.98,22 Years and 4 Months,No,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786
4,May,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",NaN,11.27,Good,809.98,22 Years and 5 Months,No,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177
5,June,Scientist,"Auto Loan, Credit-Builder Loan, Personal Loan,...",4,9.27,Good,809.98,22 Years and 6 Months,No,62.430172331195294,!@9#%8,340.4792117872438

In [99]:
#TODO : Figure out whether to drop the test.csv file altogether
#Change values in the remaining categorical columns and fix the numerical columns